In [14]:
import pandas as pd

df = pd.DataFrame({
    'nome': ['Ana', 'Bruno', 'Carlos', 'Dani'],
    'idade': [23, 35, 17, 40],
    'cidade': ['SP', 'RJ', 'SP', 'BH']
})

In [15]:
df

     nome  idade cidade
0     Ana     23     SP
1   Bruno     35     RJ
2  Carlos     17     SP
3    Dani     40     BH

In [20]:
df.sort_values('idade')
df

     nome  idade     cidade
0     Ana     23         SP
1   Bruno     35  São Paulo
2  Carlos     17         SP
3    Dani     40  São Paulo

In [22]:
df = df.sort_values('idade')
df

     nome  idade     cidade
2  Carlos     17         SP
0     Ana     23         SP
1   Bruno     35  São Paulo
3    Dani     40  São Paulo

In [30]:
df = df.sort_values('idade', ascending=False)
df

     nome  idade     cidade
3    Dani     40  São Paulo
1   Bruno     35  São Paulo
0     Ana     23         SP
2  Carlos     17         SP